In [17]:
from piper.defaults import *

In [20]:
df = get_sample_phone_sales(year=2022, freq='D', rows=10000)
head(df)

10000 rows, 10 columns

,country,region,order,order_dt,invoice_dt,delivery_dt,rep,sku,unit_price,qty
0,Norway,North,4602405,2022-07-23,2022-07-24,2022-07-27,Mr K. Starmer,Samsung Galaxy A20,560.45,1
1,France,West,4652515,2022-04-09,2022-04-10,2022-04-14,Mr. B. Johnson,Huawei P30 Pro,749.92,1
2,Spain,West,4607341,2022-11-10,2022-11-11,2022-11-14,Mrs R. Johnson,Huawei P20,434.09,1
3,Germany,Central,4755356,2022-08-02,2022-08-03,2022-08-07,Mr. D. Davis,Galaxy S10e,658.54,1

In [40]:
%%piper

df
>> assign(sales_price=lambda x: x.unit_price * x.qty)
>> where("invoice_dt.dt.month.between(3, 3)")
>> group_by(['region', 'country', 'rep'])
>> summarise(total_sales=('sales_price', 'sum'))
>> unstack()
>> flatten_cols(remove_prefix='total_sales|avg_sales')
>> reset_index()
>> pivot_longer(('region', 'country'), 'total_sales')

|Info| tuple passed, expanding to ['region', 'country']

    region      country    variable     value
0  Central      Germany  Mrs T. May  21877.91
1  Central  Switzerland  Mrs T. May   7158.75
2     East      Austria  Mrs T. May   3363.49
3     East       Poland  Mrs T. May   6100.29
4    North       Norway  Mrs T. May   6920.83
5    North       Sweden  Mrs T. May  10099.08
6    South        Italy  Mrs T. May   7424.13
7    South     Portugal  Mrs T. May   5101.39
8     West       France  Mrs T. May  14500.85
9     West        Spain  Mrs T. May   5377.24